[M_HungryLikeSkag MissionDefinition]
MissionDescription="Skagg attacked a bandit named Carlo, killing him and swallowing some of the weapons.. In Pandora, this happens more than you think. You have to kill some Skags to get Cal's lost armor.."
MissionSummary="Kill Skaggs and find the location of Carl's rifle. "
